MS-28k-r-r-15.log
28k_r_r: (g=0): rw=randread, bs=(R) 28.0KiB-28.0KiB, (W) 28.0KiB-28.0KiB, (T) 28.0KiB-28.0KiB, ioengine=libaio, iodepth=32
...
fio-3.25-15-gced2
Starting 8 processes

28k_r_r: (groupid=0, jobs=8): err= 0: pid=25090: Thu Dec 24 17:49:27 2020
  read: IOPS=137k, BW=3733MiB/s (3915MB/s)(219GiB/60019msec)
    slat (usec): min=2, max=133, avg= 5.59, stdev= 2.88
    clat (usec): min=16, max=49361, avg=1868.19, stdev=5831.46
     lat (usec): min=20, max=49365, avg=1873.92, stdev=5831.46
    clat percentiles (usec):
     |  1.00th=[  110],  5.00th=[  127], 10.00th=[  137], 20.00th=[  151],
     | 30.00th=[  169], 40.00th=[  186], 50.00th=[  200], 60.00th=[  219],
     | 70.00th=[  247], 80.00th=[  306], 90.00th=[ 4015], 95.00th=[12649],
     | 99.00th=[32637], 99.50th=[37487], 99.90th=[42730], 99.95th=[44303],
     | 99.99th=[45876]
   bw (  MiB/s): min= 3374, max= 4034, per=100.00%, avg=3739.65, stdev=15.30, samples=952
   iops        : min=123424, max=147550, avg=136764.32, stdev=559.56, samples=952
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.36%, 250=70.26%, 500=15.58%
  lat (usec)   : 750=0.51%, 1000=0.31%
  lat (msec)   : 2=1.11%, 4=1.85%, 10=3.94%, 20=2.90%, 50=3.17%
  cpu          : usr=4.73%, sys=12.60%, ctx=6627714, majf=0, minf=2124
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=8194307,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=3733MiB/s (3915MB/s), 3733MiB/s-3733MiB/s (3915MB/s-3915MB/s), io=219GiB (235GB), run=60019-60019msec

Disk stats (read/write):
    md0: ios=8560869/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%, aggrios=2144620/0, aggrmerge=0/0, aggrticks=3831393/0, aggrin_queue=3837907, aggrutil=100.00%
  nvme0n1: ios=2144925/0, merge=0/0, ticks=3203895/0, in_queue=3209719, util=99.96%
  nvme2n1: ios=2145297/0, merge=0/0, ticks=7253553/0, in_queue=7266496, util=100.00%
  nvme4n1: ios=2143060/0, merge=0/0, ticks=2807980/0, in_queue=2812017, util=99.97%
  nvme6n1: ios=2145201/0, merge=0/0, ticks=2060145/0, in_queue=2063398, util=99.95%