MS-28k-r-r-18.log
28k_r_r: (g=0): rw=randread, bs=(R) 28.0KiB-28.0KiB, (W) 28.0KiB-28.0KiB, (T) 28.0KiB-28.0KiB, ioengine=libaio, iodepth=32
...
fio-3.25-15-gced2
Starting 8 processes

28k_r_r: (groupid=0, jobs=8): err= 0: pid=26095: Thu Dec 24 19:56:23 2020
  read: IOPS=220k, BW=6006MiB/s (6298MB/s)(528GiB/90013msec)
    slat (usec): min=2, max=744, avg= 5.62, stdev= 2.47
    clat (nsec): min=595, max=41439k, avg=1158923.70, stdev=5800920.30
     lat (usec): min=16, max=41448, avg=1164.67, stdev=5800.95
    clat percentiles (usec):
     |  1.00th=[   16],  5.00th=[   19], 10.00th=[   23], 20.00th=[   27],
     | 30.00th=[   30], 40.00th=[   34], 50.00th=[   40], 60.00th=[   46],
     | 70.00th=[   56], 80.00th=[   72], 90.00th=[  117], 95.00th=[  212],
     | 99.00th=[32375], 99.50th=[32900], 99.90th=[34341], 99.95th=[34341],
     | 99.99th=[35390]
   bw (  MiB/s): min= 5399, max= 6690, per=100.00%, avg=6016.24, stdev=30.25, samples=1432
   iops        : min=197480, max=244684, avg=220021.63, stdev=1106.45, samples=1432
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=6.61%, 50=58.14%
  lat (usec)   : 100=22.88%, 250=7.93%, 500=0.86%, 750=0.06%, 1000=0.01%
  lat (msec)   : 2=0.01%, 20=0.01%, 50=3.52%
  cpu          : usr=7.06%, sys=19.59%, ctx=14286197, majf=0, minf=521
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=19771509,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=6006MiB/s (6298MB/s), 6006MiB/s-6006MiB/s (6298MB/s-6298MB/s), io=528GiB (567GB), run=90013-90013msec

Disk stats (read/write):
    md1: ios=27595340/4, merge=0/0, ticks=0/0, in_queue=0, util=0.00%, aggrios=6898835/1, aggrmerge=0/0, aggrticks=7623330/0, aggrin_queue=7637752, aggrutil=100.00%
  nvme1n1: ios=6897645/2, merge=0/0, ticks=377233/0, in_queue=377049, util=88.96%
  nvme3n1: ios=6900573/2, merge=0/0, ticks=285377/0, in_queue=284772, util=84.59%
  nvme5n1: ios=6898230/0, merge=0/0, ticks=29497538/0, in_queue=29556392, util=100.00%
  nvme7n1: ios=6898892/0, merge=0/0, ticks=333175/0, in_queue=332798, util=90.27%